fn нод(мут_а: u32, мут_b: u32) -> u32 {
    let mut а = мут_а;
    let mut b = мут_b;

    while b != 0 {
    let временно = b;
    b = а % b;
    а = временно;
    }
    а
}

#[test]
fn тест() {
    let данные = [
    ((24, 60), 12),
    ((15, 9), 3),
    ((15, 6), 3),
    ((140, 40), 20),
    ((24, 16), 8),
    ((100, 10), 10),
    ((120, 80), 40),
    ((80, 120), 40),
    ((100, 20), 20),
    ((37, 11), 1),
    ((120, 90), 30),
    ];

    for ((x, y), ожидалось) in данные.iter() {
    assert_eq!(*ожидалось, нод(*x, *y));
    }
}

fn main() {
println!("Запуск");
}